src/cf/Catalogs/ПравилаКоммуникаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПравилаКоммуникаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействительно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Назначение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предмет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПравилаКоммуникацийПредметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗадач</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыМероприятий</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ФункцииУчастниковРегистрации</v8:Type>
								<v8:Type>cfg:EnumRef.ФункцииУчастниковИсполнения</v8:Type>
								<v8:Type>cfg:EnumRef.ПравилаКоммуникацийФункцииУчастников</v8:Type>
								<v8:Type>cfg:EnumRef.ФункцииУчастниковСогласования</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыУчастниковЗадач</v8:Type>
								<v8:Type>cfg:EnumRef.ФункцииУчастниковУтверждения</v8:Type>
								<v8:Type>cfg:EnumRef.ФункцииУчастниковПодписания</v8:Type>
								<v8:Type>cfg:EnumRef.ФункцииУчастниковОзнакомления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗадач</v8:Type>
								<v8:Type>cfg:EnumRef.ПравилаКоммуникацийПредметы</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыМероприятий</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
								<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Релевантность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ограничения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнициаторСотрудник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнициаторРуководитель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнициаторРоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнициаторРольЗначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнициаторРангС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнициаторРангПО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнициаторКонтейнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПодразделений</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникСотрудник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникРуководитель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникРольЗначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникРоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникПодразделение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникРабочаяГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникКонтейнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПодразделений</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
								<v8:Type>cfg:CatalogRef.РабочиеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникРангС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникРангПО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникИерархияЕсть</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникИерархияВверх</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникИерархияВниз</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникИерархияТекущее</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникИерархияВышестоящее</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникИерархияВышестоящие</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникИерархияПодчиненное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникИерархияПодчиненные</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчастникИерархияСоседи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступныйТип</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Служебная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ПравилаКоммуникацийПредметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПравилаКоммуникацийПредметы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мероприятие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Согласующий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспечивающийСогласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготавливающийОбработкуРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготавливающийЗавершение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ФункцииУчастниковПодписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ФункцииУчастниковПодписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подписывающий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспечивающийПодписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбрабатывающийРезультат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПравилаКоммуникаций/Forms/ПроверкаПравил/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолеВыбора = Справочники.Сотрудники.ПустаяСсылка();
	НазначениеНастроить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	
	Если ЭтотОбъект[Элемент.Имя] = Неопределено Тогда
		ЭтотОбъект[Элемент.Имя] = НазначениеПоУмолчанию(Элемент.Имя, Элемент.ДоступныеТипы);
	КонецЕсли;
	
	НазначениеНастроить(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элемент.ВыбиратьТип Тогда
		Элемент.ОграничениеТипа = Элемент.ДоступныеТипы;
	КонецЕсли;
	
	Если Элемент.СписокВыбора.Количество() Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьВыборИзСписка(
			Новый ОписаниеОповещения("НазначениеОбработкаОповещения", ЭтотОбъект, Элемент.Имя),
			Элемент.СписокВыбора, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Элемент.СписокВыбора.Количество() Тогда
		СтандартнаяОбработка = Ложь;
		
		Если Текст <> "" Тогда
			Подстрока = НРег(Текст);
			Длина = СтрДлина(Подстрока);
			//@skip-check new-color
			ЦветВыделения = Новый Цвет(0, 153, 0);
			
			ДанныеВыбора = Новый СписокЗначений;
			Для Каждого Выборка Из Элемент.СписокВыбора Цикл
				Если НРег(Лев(Выборка.Представление, Длина)) = Подстрока Тогда
					//@skip-check new-font
					ДанныеВыбора.Добавить(Выборка.Значение, 
						Новый ФорматированнаяСтрока(
							Новый ФорматированнаяСтрока(
								Лев(Выборка.Представление, Длина),
								Новый Шрифт(,, Истина),
								ЦветВыделения),
							Сред(Выборка.Представление, Длина + 1)));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСАдреснойКнигойКлиент.ВыбратьУчастника(
		ЭтотОбъект,
		Элемент,
		СтандартнаяОбработка,
		ПолеВыбора,,,
		Новый Структура("ПравилаКоммуникаций", КонтекстВыбора()));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если РаботаСАдреснойКнигойКлиент.ОбработатьВыборУчастника(
			ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Тогда
		
		ПолеВыбора = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ПараметрыПолученияДанных.Вставить("ПравилаКоммуникаций", КонтекстВыбора());
	
	РаботаСАдреснойКнигойКлиент.ПодобратьУчастника(
		ЭтотОбъект,
		Элемент,
		Текст,
		ДанныеВыбора,
		ПараметрыПолученияДанных,
		Ожидание,
		СтандартнаяОбработка,
		ПолеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПараметрыПолученияДанных.Вставить("ПравилаКоммуникаций", КонтекстВыбора());
	
	РаботаСАдреснойКнигойКлиент.ПодобратьУчастника(
		ЭтотОбъект,
		Элемент,
		Текст,
		ДанныеВыбора,
		ПараметрыПолученияДанных,
		0,
		СтандартнаяОбработка,
		ПолеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыбораПриИзменении(Элемент)
	
	Если ПолеВыбора = Неопределено Тогда
		ПолеВыбора = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициаторОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СотрудникиКлиент.СотрудникОбработкаВыбора(ЭтотОбъект, "Инициатор", ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПравила

&НаКлиенте
Процедура ПравилаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(, Элементы.Правила.ТекущиеДанные.Значение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НазначениеОбработкаОповещения(ВыбранноеЗначение, ИмяЭлемента) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ЭтотОбъект[ИмяЭлемента] = ВыбранноеЗначение.Значение;
		НазначениеПриИзменении(Элементы[ИмяЭлемента]);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НазначениеНастроить(ЭлементИмя = Неопределено)
	
	Если ЭлементИмя <> Неопределено Тогда
		Элемент = Элементы[ЭлементИмя];
	КонецЕсли;
	
	Если Элемент = Неопределено Или Элемент.Имя = "Предмет" Тогда
		Если Предмет = ПредопределенноеЗначение("Перечисление.ПравилаКоммуникацийПредметы.Документ") Тогда
			Элементы.Вид.ДоступныеТипы = Новый ОписаниеТипов(
				"СправочникСсылка.ВидыДокументов, СправочникСсылка.ТематикиДокументов");
		ИначеЕсли Предмет = ПредопределенноеЗначение("Перечисление.ПравилаКоммуникацийПредметы.Задача") Тогда
			Элементы.Вид.ДоступныеТипы = Новый ОписаниеТипов(
				"СправочникСсылка.ВидыЗадач");
		ИначеЕсли Предмет = ПредопределенноеЗначение("Перечисление.ПравилаКоммуникацийПредметы.Мероприятие") Тогда
			Элементы.Вид.ДоступныеТипы = Новый ОписаниеТипов(
				"СправочникСсылка.ВидыМероприятий");
		Иначе
			Элементы.Вид.ДоступныеТипы = Новый ОписаниеТипов(
				"СправочникСсылка.ВидыДокументов,
				|СправочникСсылка.ТематикиДокументов,
				|СправочникСсылка.ВидыЗадач,
				|СправочникСсылка.ВидыМероприятий");
		КонецЕсли;
		Вид = Элементы.Вид.ДоступныеТипы.ПривестиЗначение(Вид);
		
		ПараметрВыбора = Новый ПараметрВыбора(
			"Отбор.Ссылка",
			Справочники.ПравилаКоммуникаций.ПоддерживаемыеВидыПредметов(Предмет));
		
		Элементы.Вид.ПараметрыВыбора =
			Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрВыбора));
			
		Справочники.ПравилаКоммуникаций.НастроитьПолеПозиции(ЭтотОбъект);
	КонецЕсли;
	
	Если Элемент = Неопределено Или Элемент.Имя = "Вид" Тогда
		Справочники.ПравилаКоммуникаций.НастроитьПолеПозиции(ЭтотОбъект);
	КонецЕсли;
	
	Если Элемент = Неопределено Или Элемент.Имя = "Предмет" Или Элемент.Имя = "Позиция" Тогда
		Элементы.Этап.Доступность = НазначениеДоступенЭтап(Предмет, Позиция);
		Если Элементы.Этап.Доступность Тогда
			Если Элементы.Этап.СписокВыбора.Количество() = 0 Тогда
				Для Каждого Выборка Из РаботаСЭтапамиВызовСервера.ДанныеВыбора("", Неопределено, Новый Массив) Цикл
					ЗаполнитьЗначенияСвойств(Элементы.Этап.СписокВыбора.Добавить(), Выборка);
				КонецЦикла;		
			КонецЕсли;
		Иначе
			Этап = НазначениеПоУмолчанию("Этап", Элементы.Этап.ДоступныеТипы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НазначениеПоУмолчанию(ИмяПоля, ТипЗначения)
	
	Если ИмяПоля = "Позиция" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ПравилаКоммуникацийПредметы.ПустаяСсылка");
	ИначеЕсли ИмяПоля = "Вид" Тогда
		Возврат ПредопределенноеЗначение("Справочник.ВидыДокументов.ПустаяСсылка");
	ИначеЕсли ТипЗначения.Типы().Количество() > 1 Тогда
		Возврат Новый(ТипЗначения.Типы()[0]);
	Иначе
		Возврат ТипЗначения.ПривестиЗначение();
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция НазначениеДоступенЭтап(Предмет, Позиция)
	
	Возврат Предмет <> Перечисления.ПравилаКоммуникацийПредметы.Задача
			И (ЗначениеЗаполнено(Позиция)
				И (Позиция = Перечисления.ФункцииУчастниковСогласования.Согласующий
					Или Позиция = Перечисления.ФункцииУчастниковПодписания.Подписывающий));
	
КонецФункции

&НаКлиенте
Функция КонтекстВыбора()
	
	Контекст = ПоляНазначения();
	ЗаполнитьЗначенияСвойств(Контекст, ЭтотОбъект);
	
	Если ТипЗнч(Вид) = Тип("СправочникСсылка.ТематикиДокументов") Тогда
		Контекст.Вставить("Тематика", Вид);
		Контекст.Вставить("Вид", ?(ЗначениеЗаполнено(Вид),
			ОбщегоНазначенияДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(Вид, "ВидДокумента"),
			ПредопределенноеЗначение("Справочник.ВидыДокументов.ПустаяСсылка")));
	КонецЕсли;
	
	Возврат Контекст;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПоляНазначения()
	
	ПоляНазначения = Новый Структура;
	ПоляНазначения.Вставить("РежимОтладки", Истина);
	ПоляНазначения.Вставить("Предмет", Неопределено);
	ПоляНазначения.Вставить("Позиция", Неопределено);
	ПоляНазначения.Вставить("Этап", Неопределено);
	ПоляНазначения.Вставить("Вид", Неопределено);
	ПоляНазначения.Вставить("Инициатор", Неопределено);
	
	Возврат ПоляНазначения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Контекст = ПоляНазначения();
	ЗаполнитьЗначенияСвойств(Контекст, ЭтотОбъект);
	
	Если ТипЗнч(Вид) = Тип("СправочникСсылка.ТематикиДокументов") Тогда
		Контекст.Вставить("Тематика", Вид);
		Контекст.Вставить("Вид", ?(ЗначениеЗаполнено(Вид),
			ОбщегоНазначенияДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(Вид, "ВидДокумента"),
			ПредопределенноеЗначение("Справочник.ВидыДокументов.ПустаяСсылка")));
	КонецЕсли;
	
	Правила.ЗагрузитьЗначения(Справочники.ПравилаКоммуникаций.ПодобратьПравило(Контекст, Истина));
	
КонецПроцедуры

#КонецОбласти
